Z81324.CBL(XML001) - 01.02

IDENTIFICATION DIVISION.
PROGRAM-ID. XML001.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DADOS.
 02 REGISTRO OCCURS
    05 NOME     PIC X(20).
    05 ENDERECO PIC X(40).
 02 REGISTRO1.
    05 NOME1    PIC X(20). VALUE 'NOME 1'.
    05 ENDERECO1 PIC X(40). VALUE 'END 1'.
 02 REGISTRO2.
    05 NOME2    PIC X(20). VALUE 'NOME 2'.
    05 ENDERECO2 PIC X(40). VALUE 'END 2'.
01 XMLTEXT  PIC N(2000).
01 CONTADOR PIC 9999.
PROCEDURE DIVISION.
    MOVE 'JONAS BLOCH'            TO NOME.
    MOVE 'AVENIDA IPIRANGA, 130'  TO ENDERECO.
       XML GENERATE XMLTEXT FROM DADOS COUNT CONTADOR
           ON EXCEPTION
              DISPLAY 'ERRO NA CONVERSAO XML  ' XML-CODE
           NOT ON EXCEPTION
              DISPLAY 'XML   CRIADO.'
              DISPLAY XMLTEXT(1:CONTADOR)
              DISPLAY FUNCTION DISPLAY-OF(XMLTEXT(1:CONTADOR))
              DISPLAY 'VALOR DO CONTADOR ' CONTADOR
        END-XML.
        STOP RUN.  