Z81324.CBL(JSON) - 01.01

PROGRAM-ID. ARQJSON.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DADOS.
 02 LINHA PIC X(80) OCCURS 2.
01 JTEXT NATIONAL PIC N(2000).
01 I  PIC 99.
PROCEDURE DIVISION.
    MOVE 'LINHA 1' TO LINHA(1), MOVE 'LINHA 2' TO LINHA(2).
       JSON GENERATE JTEXT FROM DADOS COUNT I
           ON EXCEPTION
              DISPLAY 'ERRO NA CONVERSAO JSON ' JSON-CODE
           NOT ON EXCEPTION
              DISPLAY 'JSON CRIADO.'
              DISPLAY JTEXT(1:I)
              DISPLAY FUNCTION DISPLAY-OF(JTEXT(1:I))
              DISPLAY 'VALOR DO COUNTER ' I
        END-JSON.
        STOP RUN.