GR.BRQ00.JOBLIB(COMPCOB) - 1.27

//BRQ00XXX JOB 'SUPORTE' ,CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//         JCLLIB  ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBOL,USER=BRQ00,PROG='INSPECT'
//LKED.SYSIN  DD   *
  NAME  INSPECT(R)
/*



GR.BRQ00.JOBLIB(EXECOB) - 01.11

//BRQ00XXX JOB 'EXECDATA' ,CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//EXECUTAR EXEC PGM=INSPECT
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR