23. PRATICA - TRABALHANDO COM VARIÁVEIS

HERC01.LIBS.COBOL(PROG002)

IDENTIFICATION                     DIVISION.
PROGRAM-ID. PROG002.
ENVIRONMENT                        DIVISION.
DATA                               DIVISION.
WORKING-STORAGE                    SECTION.
77  WRK-NOME        PIC X(30).
77  WRK-EMPRESA     PIC X(15).
PROCEDURE                          DIVISION.
    ACCEPT WRK-NOME.
    ACCEPT WRK-EMPRESA.
    DISPLAY 'NOME.....' WRK-NOME.
    DISPLAY 'EMPRESA..' WRK-EMPRESA.
    STOP RUN.