29. Pratica - Tomando decisões no programa com comando IF

HERC01.LIBS.COBOL(PROG007) - 1.00

IDENTIFICATION                  DIVISION.
PROGRAM-ID. PROG003.
ENVIRONMENT                     DIVISION.
DATA                            DIVISION.
WORKING-STORAGE                 SECTION.
77  WRK-V1  PIC 9(02)V99 VALUE ZEROS.
77  WRK-V2  PIC 9(02)V99 VALUE ZEROS.
77  WRK-MEDIA PIC 9(03)V99 COMP VALUE ZEROS.
77  WRK-MEDIA-ED PIC ZZ9,99 VALUE ZEROS.
PROCEDURE                       DIVISION.
    ACCEPT WRK-V1.
    ACCEPT WRK-V2.
*====================================================
       COMPUTE WRK-MEDIA = (WRK-V1 + WRK-V2) / 2.
        MOVE WRK-MEDIA TO WRK-MEDIA-ED.
        DISPLAY 'MEDIA  ' WRK-MEDIA-ED.
       IF WRK-MEDIA LESS THAN 2 OR WRK-MEDIA EQUAL 2
          DISPLAY  'ALUNO REPROVADO'
       IF WRK-MEDIA LESS THAN 6 AND WRK-MEDIA GREATER THAN 2
          DISPLAY  'ALUNO RECUPERACAO'
       IF WRK-MEDIA GREATER THAN 6 OR WRK-MEDIA EQUAL 6
          DISPLAY  'ALUNO APROVADO' 

       IF WRK-MEDIA < THAN 2 OR WRK-MEDIA = 2
          DISPLAY  'ALUNO REPROVADO'
       IF WRK-MEDIA < THAN 6 OR WRK-MEDIA > 2
          DISPLAY  'ALUNO RECUPERACAO'
       IF WRK-MEDIA > 6 OR WRK-MEDIA = 6
          DISPLAY  'ALUNO APROVADO'         
       STOP RUN.
