


IDENTIFICATION DIVISION.
PROGRAM-ID. pINSPECT.
ENVIRONMENT    DIVISION.
DATA           DIVISION.
WORKING-STORAGE SECTION.
77 STRING1 PIC X(30) VALUE 'RIO DE JANEIRO'.
PROCEDURE      DIVISION.
    INSPECT STRING1 CONVERTING
    'ABCDEFGHIJKLMNOPQRSTUVWXYZ' TO 'abcdefghijklmnopqrstuvwxyz'
    DISPLAY STRING1.
    STOP RUN.