GR.BRQ00.JOBLIB(COMPCOB) - 01.29

//BRQ00XXX JOB 'SUPORTE' ,CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//         JCLLIB  ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBOL,USER=BRQ00,PROG='PERFORM'
//LKED.SYSIN  DD   *
  NAME  PERFORM(R)
/*


GR.BRQ00.JOBLIB(EXECOB) - 01.12

//BRQ00XXX JOB 'EXECDATA' ,CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//EXECUTAR EXEC PGM=PERFORM
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR