34. Demonstracao - Diferença entre AFTER e BEFORE no comando PERFORM

GR.BRQ00.COBLIB(PERFORM) - 01.01

IDENTIFICATION DIVISION.
PROGRAM-ID. PPERFORM.
AUTHOR. ANDRE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 X   PIC 9 VALUE ZEROS.
PROCEDURE DIVISION.
10000-PARA.
      MOVE 5 TO X.
      PERFORM 20000-PARA WITH TEST BEFORE UNTIL X = 5.
      DISPLAY 'ACABOU O PROGRAMA'.
      STOP RUN.
20000-PARA.
      DISPLAY 'VALOR DE X = ' X.
      ADD 1 TO X. 



GR.BRQ00.COBLIB(PERFORM) - 01.01

IDENTIFICATION DIVISION.
PROGRAM-ID. PPERFORM.
AUTHOR. ANDRE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 X   PIC 9 VALUE ZEROS.
PROCEDURE DIVISION.
10000-PARA.
      MOVE 5 TO X.
      PERFORM 20000-PARA WITH TEST AFTER UNTIL X = 5.
      DISPLAY 'ACABOU O PROGRAMA'.
      STOP RUN.
20000-PARA.
      DISPLAY 'VALOR DE X = ' X.
      ADD 1 TO X.